{"id": "bytedance-tiktok-front-end-interview-questions-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#bytedance-tiktok-front-end-interview-questions", "title": "ByteDance/TikTok Front End Interview Questions", "chunk_index": 0, "text": "ByteDance/TikTok Front End Interview Questions\n\n"}
{"id": "javascript-coding-questions-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#javascript-coding-questions", "title": "JavaScript coding questions ​", "chunk_index": 0, "text": "JavaScript coding questions ​\n\nImplement Promise.all . Practice question (Free) Implement a function which extends Array.prototype . Practice questions"}
{"id": "user-interface-coding-questions-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#user-interface-coding-questions", "title": "User interface coding questions ​", "chunk_index": 0, "text": "User interface coding questions ​\n\nImplement a dropdown component. Read answer (Paid)"}
{"id": "quiz-questions-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#quiz-questions", "title": "Quiz questions ​", "chunk_index": 0, "text": "Quiz questions ​\n\nDifference between localStorage and cookies. Read answer (Free)"}
{"id": "algorithm-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#algorithm", "title": "Algorithm ​", "chunk_index": 0, "text": "Algorithm ​\n\nMerge two sorted integer arrays, remove duplicates. You have an image on a page, write css and js so that when mouse is over the image, it rotates 180 deg with 1 sec animation. Given a list of points, find out if any four of them form a square. Return 'true' if possible, else 'false'. Examples: [[0, 0], [2, 0], [1, 1], [0, -1], [-1, -1], [0, 2], [0, 1], [1,0]] -> true Check for balanced brackets in a string. Given two nodes, return the section of the tree between these two nodes. Find the islands in a grid of land and sea.\n\nSource: Glassdoor ByteDance Front End Developer Interview Questions"}
{"id": "insider-tips-from-the-greatfrontend-community-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#insider-tips-from-the-greatfrontend-community", "title": "Insider tips from the GreatFrontEnd community ​", "chunk_index": 0, "text": "Insider tips from the GreatFrontEnd community ​\n\nThese tips were shared by GreatFrontEnd users who have completed interviews with ByteDance/TikTok.\n\n17th Nov 2024 :\n\ncant say too much because of NDA but this is how it went for TikTok entry level FE leetcodes, javascript fundamentals (covered in GFE 1 month study plan) UI component + follow up system design based on past project + javascript coding and now awaiting 4th round w recruiter feedback for each round was fairly quick, received update the next morning\n\n12th Nov 2024 :\n\ni do bytedance/tiktok round 2 recently, unfortunately get rejected. the coding questions is quite overwhelming for me. after experience & quiz questions, the interviewer directly give me 3 questions (all for ~30 mins), and i can choose the order. similar to Map Async Limit but has to be solution 4 some compose middleware question (can't find anything similar) implement bind, but i can't handle the new keyword\n\n21st Oct 2024 :\n\njust finish my third rounds intervie"}
{"id": "insider-tips-from-the-greatfrontend-community-1", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#insider-tips-from-the-greatfrontend-community", "title": "Insider tips from the GreatFrontEnd community ​", "chunk_index": 1, "text": " Limit but has to be solution 4 some compose middleware question (can't find anything similar) implement bind, but i can't handle the new keyword\n\n21st Oct 2024 :\n\njust finish my third rounds interview with with TikTok. it's a design round with 50 mins deep dive on my pervious project and potential improvement. have to draw a flowchart to demo the workflow. overall it's really conversation heavy. and also asked why you want to join TikTok. don't think I am going to pass this round but Good Luck to whoever interview later! 🙏\n\n8th Aug 2024 :\n\nHad my first round tiktok frontend engineer interview. Not sure on the level but I told them I have 3 YOE so maybe 2-1? Strange interview tbh. There was a huge language barrier and it was difficult to build rapport with the interviewer (my interview was at night so I had someone overseas). Very difficult to read. First 20 minutes was talking about past projects/experiences/challenges, then a React coding question, then a JS quiz question, and then a"}
{"id": "insider-tips-from-the-greatfrontend-community-2", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#insider-tips-from-the-greatfrontend-community", "title": "Insider tips from the GreatFrontEnd community ​", "chunk_index": 2, "text": " at night so I had someone overseas). Very difficult to read. First 20 minutes was talking about past projects/experiences/challenges, then a React coding question, then a JS quiz question, and then an untagged tiktok LC med... I asked some good questions about the company imo but the interviewer could barely answer it. I tried my best but it was not a collaborative interview at all and more of a test so it was challenging for me. I think it was a lot for an hour and we ended up going over time\n\n18th Jun 2024 :\n\nHad a second round interview with TikTok, thought I did good but didn't go through. I was asked transfer list, implemented it quick, but they interview on Lark which doesn't support React and you code in nodejs env, so no way to test anything that you write. Second question was react like VDom but instead of creating a DOM you just create a HTML string output given an input object with type and attributes. Maybe it was transfer list implementation. which I didn't compose using "}
{"id": "insider-tips-from-the-greatfrontend-community-3", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#insider-tips-from-the-greatfrontend-community", "title": "Insider tips from the GreatFrontEnd community ​", "chunk_index": 3, "text": "ct like VDom but instead of creating a DOM you just create a HTML string output given an input object with type and attributes. Maybe it was transfer list implementation. which I didn't compose using different components.\n\nFor more insider tips, visit GreatFrontEnd !"}
{"id": "table-of-contents-0", "source_url": "https://www.frontendinterviewhandbook.com/companies/bytedance-tiktok-front-end-interview-questions#table-of-contents", "title": "Table of Contents", "chunk_index": 0, "text": "Table of Contents\n\nJavaScript coding questions User interface coding questions Quiz questions Algorithm Insider tips from the GreatFrontEnd community"}
